["Whenever Leslie asks me for the Latin names of any of our plants, I just give her the names of rappers. Those are some Diddies. Those are some Bone Thugs-N-Harmoniums, right here. Those Ludacrises are coming in great.","How do you make any event classy on a budget? Red carpet. My entire apartment is red carpet. On top of that, leading into my bedroom, a second red carpet. Oh, what’s this in my shoe? Red carpet insole. Everywhere I go, I’m walking on red carpet.","It’s like I’m not even camping. This is actually a dog couch, but it’s super comfortable.","At the risk of bragging, one of the things I’m best at is riding coattails. Behind every successful man is me. Smiling and taking partial credit.","Oh, am I wearing an ascot? I didn’t notice.","Yes, I’m married. But my wife understands that a good politician has to be appealing to the ladies. The fact that I haven’t even gotten close to cheating on her is a disappointment to us both.","Everyone steals. My favorite movie is Love Don’t Cost a Thing with Nick Cannon. Which is based on Can’t Buy Me Love, which is based on Kramer vs. Kramer, or something, which I think was Shakespeare.","When I’m dating someone, I have a list called my ‘Oh No Nos.’ If a woman commits a Oh No No, it can end the relationship. Not loving ‘90s R&B music is #3 on the Oh No Nos list. Girl don’t even know who Ginuwine is.","I strapped an MP3 player to one of those floor-cleaning robots. Call him DJ Roomba. Little guy cruises around and plays music. What’s hot, DJ Roomba! DJ Roomba, tearin’ it up!","Sometimes you gotta work a little, so you can ball a lot.","Make-A-Baby Tuxedo clothing line. A department store with a guest list. White fur earmuffs for men. Contact lenses that display text messages. Invent a phone that smells good. Own a nightclub, call it Eclipse, that’s only open for one hour two times a year. Cover charge? Five thousand dollars.","Justin is hip. Pawnee is the opposite of hip. People in this town are just now getting into Nirvana. I don’t have the heart to tell them what’s gonna happen to Kurt Cobain in 1994.","I have no interest in art. Let me clarify: I have no interest in non-nude images.","I can’t keep referring to basketball players as Khloe Kardashian’s husband and his friends.","She broke up with me. Didn’t really tell me why. Luckily when you’re the guy, you just tell people she’s crazy. ‘Hey Tom, I heard you and Lucy broke up.’ ‘Yeah man. Turns out, she’s crazy’ That’s what they always do on Entourage.","I want to open up my own club one day. Maybe call it something like Club a Dub Dub, or the Club Marine. Sort of a submarine-themed club. Or Tom’s Bistro. The word ‘bistro’ is classy as shit.","Most people would say ‘the deets’, but I say ‘the tails’. Just another example of innovation.","Yeah, I’ve been a little down. Totally natural. I’m getting a divorce, but now I’m ready to pull myself up by some G-strings.","I have never taken the high road. But I tell other people to ‘cause then there’s more room for me on the low road.","If your job was remotely interesting, there would be a show on A&E about it.","The four sweetest words in the English language: you wore me down.","You can’t say your favorite kind of cake is birthday cake. That’s like saying your favorite kind of cereal is breakfast cereal.","Every now and then, we have these little gatherings, and Leslie gets plastered. One time, I convinced her to try to fax someone a Fruit Roll-Up.","I love gChat, you can talk to anybody! I hit up brad.pitt. It wasn’t the actor. It was actually a guy named Brad that’s a teacher in Pittsburgh. We don’t have a lot in common, but we chat quite a bit.","Everyday I start by hitting up Facebook, Twitter, Tumblr, and Instagram. Sometimes, I like to throw in LinkedIn, for the professional shawties.","Emojis are little cartoons you text instead of words. Instead of saying, ‘What up, boo?’ you can type ‘What up’ and then a cute little ghost because that means boo. There’s even a little Indian guy, but he has a turban on, which I think is racist.","Jean Ralphio and I have one called Nacho Average Podcast where we rate different kinds of nachos.","Zerts are what I call desserts. Tray-trays are entrées. I call sandwiches ‘sammies,’ ‘sandoozles,’ or ‘Adam Sandlers.’ I call eggs ‘pre-birds,’ or ‘future birds.’ Root beer is ‘super water.’ And I call forks ‘food rakes'.","Treat. Yo. Self.", "I am a party scientist. Welcome to my laboratory."]